rule_id: 7f59e71d-13e3-4b37-998c-e8d87500c490
name: AD Service Account Interactive Logon
description: |
  Servis yoki tizim akkauntining interaktiv (Type 2) yoki RDP (Type 10) orqali kirganini aniqlaydi.
  Bu servis akkauntining paroli o'g'irlanganligini anglatishi mumkin.
type: esql
params: '{}'
schedule_interval: 10m
index:
- logs-winlog*
query_language: esql
query: |
  FROM logs-winlog*
  | WHERE event.code == "4624"
  | EVAL logon_type = winlog.event_data.LogonType
  | WHERE logon_type IN ("2", "10")
  | EVAL user = winlog.event_data.TargetUserName
  | WHERE user RLIKE "(?i)(svc.*|service.*|sql.*|db.*)"
  | KEEP agent_id, @timestamp, user, winlog.computer_name, logon_type
  | SORT @timestamp DESC
enabled: false
tags:
  - detection.credential_access
  - monitoring.service_accounts
severity: medium
risk_score: 60
nist: []
pci_dss: []
gdpr: []
mitre_attack: []