rule_id: 24771986-3d29-446d-a2c4-7dbf3848cb0e
name: AD Sensitive Share Access - SYSVOL/NETLOGON
description: |
  Kritik AD tarmoq papkalariga (SYSVOL, NETLOGON) kirishni aniqlaydi (Event ID 5140).
  Hujumchilar ushbu papkalardan konfiguratsiya fayllari yoki parollarni o'g'irlash uchun foydalanishi mumkin.
  SOC triage:
  - `src_ip` va `user` ning ushbu papkaga kirish vakolati borligini tekshiring.
  - Kirish odatiy administrativ ishlar bilan bog'liqligini aniqlang.
type: esql
params: '{}'
schedule_interval: 10m
index:
- logs-winlog*
query_language: esql
query: |
  FROM logs-winlog*
  | WHERE event.code == "5140"
  | EVAL share_name = winlog.event_data.ShareName
  | WHERE share_name RLIKE "(?i).*\\\\(SYSVOL|NETLOGON).*"
  | EVAL user = winlog.event_data.SubjectUserName
  | EVAL src_ip = winlog.event_data.IpAddress
  | KEEP @timestamp, user, src_ip, share_name, host.hostname
  | SORT @timestamp DESC
enabled: false
tags:
  - detection.collection
  - monitoring.shares
severity: medium
risk_score: 40
nist: []
pci_dss: []
gdpr: []
mitre_attack: []