rule_id: 7710588c-f62e-4ebd-9de6-96ef2b1f8033
name: AD User Account Deleted - Impact Monitoring
description: |
  Foydalanuvchi o'chirilishi (Event ID 4726) izlarni yashirish yoki servislar ishini to'xtatish uchun ishlatilishi mumkin.
  SOC triage bosqichlari:
  - O'chirilgan akkaunt muhim (imtiyozli) yoki yo'qligini tekshiring.
  - `actor` kimligini va bu uning vakolatiga kirishini tasdiqlang.
type: esql
params: '{}'
schedule_interval: 10m
index:
- logs-winlog*
query_language: esql
query: |
  FROM logs-winlog*
  | WHERE event.code == "4726"
  | EVAL hostn = winlog.computer_name
  | EVAL actor = winlog.event_data.SubjectUserName
  | EVAL target_user = winlog.event_data.TargetUserName
  | KEEP agent_id, @timestamp, hostn, actor, target_user
  | SORT @timestamp DESC
enabled: false
tags:
  - detection.impact
  - monitoring.account_lifecycle
severity: low
risk_score: 25
nist: []
pci_dss: []
gdpr: []
mitre_attack: []