rule_id: 7d02b030-24fb-4db4-b3ed-ab087e08e33c
name: "VsCode Code Tunnel Execution File Indicator"
description: |
  Detects creation of a file named "code_tunnel.json", an indicator of Visual Studio Code tunneling
  utility usage. This feature can be abused to establish an external access / C2-like channel.
  False positives: Legitimate VSCode tunnel usage will also trigger this.
type: esql
params: '{}'
schedule_interval: 10m
index:
  - logs-winlog*
query_language: esql
query: |
 FROM logs-winlog*
  // File event telemetry
  | WHERE event.category == "file" OR event.dataset RLIKE "(?i).*file.*"
  // Evaluate path to simplify logic
  | EVAL p = COALESCE(winlog.event_data.OriginalFileName, "")
  // Selection: TargetFilename ends with \code_tunnel.json
  | WHERE p RLIKE "(?i).*\\\\code_tunnel\\\\.json$"
  | STATS
      event_count = COUNT(*),
      users = VALUES(winlog.event_data.TargetUserName),
      processes = VALUES(winlog.event_data.ProcessName),
      executables = VALUES(winlog.event_data.ProcessName),
      parents = VALUES(winlog.event_data.CallerProcessName),
      parent_executables = VALUES(winlog.event_data.CallerProcessName),
      file_paths = VALUES(winlog.event_data.OriginalFileName),
      cmdlines = VALUES(COALESCE(winlog.event_data.CommandLine, winlog.event_data.CommandLine, ""))
    BY 
      host.name, 
      bucket = DATE_TRUNC(20m, @timestamp)
  | WHERE event_count >= 1
  | KEEP 
      agent_id, bucket, 
      host.name, 
      event_count, 
      users, 
      processes, 
      executables, 
      parents, 
      parent_executables, 
      cmdlines, 
      file_paths
  | SORT event_count DESC
enabled: false
tags:
  - attack.command-and-control
  - detection.threat-hunting
severity: medium
risk_score: 50
references:
  - "https://ipfyx.fr/post/visual-studio-code-tunnel/"
  - "https://badoption.eu/blog/2023/01/31/code_c2.html"
nist: ["SI-4", "AU-12"]
pci_dss: ["10.2"]
gdpr: ["32.1.b"]
mitre_attack:
  TA0011:
    T1071: []
